jlckfb/Candis-S31/firmware/camera_test/sdkconfig.defaults
# Candis-S31 camera driver and visual confirmation baseline.
CONFIG_IDF_TARGET="esp32s31"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n
# Leave a visible UART attachment window after reset; the test itself then
# displays the live camera image and waits for operator PASS/FAIL input.
CONFIG_CAMERA_TEST_BOOT_DELAY_MS=5000

# Display configuration is intentionally explicit: visual confirmation is
# required before the final result can be PASS.
CONFIG_BSP_LCD_PIXEL_CLOCK_MHZ=48
CONFIG_BSP_LCD_TE_SYNC=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=48
CONFIG_BSP_LCD_DRAW_BUF_DOUBLE=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
CONFIG_LV_DRAW_BUF_ALIGN=64
CONFIG_LV_DRAW_SW_SUPPORT_RGB565_SWAPPED=y
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_FONT_MONTSERRAT_16=y

# Report failures in the application instead of aborting before the serial
# result line is printed.
CONFIG_BSP_ERROR_CHECK=n

# Conservative, known-good boot transport for a camera-only diagnostic.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Camera buffers are driver-owned MMAP buffers and normally live in PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_MEMTEST=y

# Keep XCLK on the validated board-owned 20 MHz LEDC path. The board profile
# compensates the nominal upstream mode table through the sensor PLL.
CONFIG_BSP_CAMERA_XCLK_USE_LEDC=y

# Keep both verified RGB565X and UYVY sensor tables available. Select UYVY
# as the boot-time default so esp_video initializes the DVP controller as
# CAM_CTLR_COLOR_YUV422; the device cannot change color families after open.
CONFIG_CAMERA_OV5640=y
CONFIG_CAMERA_OV5640_AUTO_DETECT_DVP_INTERFACE_SENSOR=y
CONFIG_CAMERA_OV5640_DVP_RGB565_BE_800X600_10FPS=y
CONFIG_CAMERA_OV5640_DVP_YUV422_800X600_10FPS=y
CONFIG_CAMERA_OV5640_DVP_DEFAULT_FMT_YUV422_800X600_10FPS=y
CONFIG_CAMERA_TEST_AUTOFOCUS=y
CONFIG_CAMERA_OV3660=n
CONFIG_CAM_CTRL_SPI_ENABLE=n

# Preserve raw RGB565X bytes for this diagnostic; no esp_video preprocessing
# should hide a sensor/DVP byte-order error.
CONFIG_ESP_VIDEO_ENABLE_DVP_VIDEO_DEVICE=y
CONFIG_ESP_VIDEO_ENABLE_DATA_PREPROCESSING=n
CONFIG_ESP_VIDEO_ENABLE_SWAP_BYTE=n

# LVGL tick runs at 1 ms in the BSP (lvgl_port_cfg.timer_period_ms);
# HZ 1000 matches the validated factory/demo/player baseline.
CONFIG_FREERTOS_HZ=1000
